import pytest

from src.masks import get_mask_account, get_mask_card_number


@pytest.mark.parametrize(
    "card_number, expected",
    [
        ("2200358209833331", "2200 35** **** 3331"),
        ("2200358209876184", "2200 35** **** 6184"),
        ("2200358209920567", "2200 35** **** 0567"),
        ("Visa 2200358209920567", "Номер карты указан неверно"),
        ("Master card 2200358209920567", "Номер карты указан неверно"),
        ("asdasfasfasfaadfadfadfadfadfadsfa", "Номер карты указан неверно"),
        ("9833331", "Номер карты указан неверно"),
        ("a200358209833331", "Номер карты указан неверно"),
        ("213123213123129833331", "Номер карты указан неверно"),
        ("", "Номер карты указан неверно"),
        (" ", "Номер карты указан неверно"),
        (",.,/", "Номер карты указан неверно"),
    ],
)
def test_get_mask_card_number(card_number, expected):
    assert get_mask_card_number(card_number) == expected


@pytest.mark.parametrize(
    "account_number, expected",
    [
        ("56873457634785634876", "**4876"),
        ("45873457634896563445", "**3445"),
        ("56873457324155634205", "**4205"),
        ("Счет 56873457324155634205", "Номер счета указан неверно"),
        ("8734", "Номер счета указан неверно"),
        ("assaasafdadfadfadfad", "Номер счета указан неверно"),
        ("as8734573241556342sa", "Номер счета указан неверно"),
        ("568734576", "Номер счета указан неверно"),
        ("5687312312312312324324576", "Номер счета указан неверно"),
        ("asad568734543476", "Номер счета указан неверно"),
        ("", "Номер счета указан неверно"),
        (" ", "Номер счета указан неверно"),
        (",./,", "Номер счета указан неверно"),
    ],
)
def test_get_mask_account(account_number, expected):
    assert get_mask_account(account_number) == expected
